# 04: Pemilihan kolom (columns selection) pada Data Frame berdasarkan tipe data

# Import Modules

In [2]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.2.2
1.26.4

# Persiapan Data Frame

In [3]:
## DEPRICATED ##
# n_rows = 5
# n_cols = 2
# cols = ['bil_pecahan', 'bil_bulat']

# df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), 
#                   columns=cols)
# df['bil_pecahan'] = df['bil_pecahan'].astype('float')

# df.index = pd.util.testing.makeDateIndex(n_rows, freq='H')
# df = df.reset_index()

# df['teks'] = list('ABCDE')

# df

In [4]:
n_rows = 5
n_cols = 2
cols = ['bil_pecahan', 'bil_bulat']

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), columns=cols)

df['bil_pecahan'] = df['bil_pecahan'].astype('float')

df.index = pd.date_range(start='2024-10-01', periods=n_rows, freq='h')

df = df.reset_index()
df['teks'] = list('ABCDE')

df

                index  bil_pecahan  bil_bulat teks
0 2024-10-01 00:00:00         19.0         17    A
1 2024-10-01 01:00:00          4.0          6    B
2 2024-10-01 02:00:00         15.0          8    C
3 2024-10-01 03:00:00          4.0          2    D
4 2024-10-01 04:00:00         14.0         14    E

In [5]:
df.dtypes

index          datetime64[ns]
bil_pecahan           float64
bil_bulat               int32
teks                   object
dtype: object

# Memilih kolom bertipe data numerik

In [6]:
df.select_dtypes(include='number')

   bil_pecahan  bil_bulat
0         19.0         17
1          4.0          6
2         15.0          8
3          4.0          2
4         14.0         14

In [7]:

df.select_dtypes(include='float')

   bil_pecahan
0         19.0
1          4.0
2         15.0
3          4.0
4         14.0

In [8]:
df.select_dtypes(include='int')

   bil_bulat
0         17
1          6
2          8
3          2
4         14

# Memilih kolom bertipe data string atau object

In [10]:
df.select_dtypes(include='object')

  teks
0    A
1    B
2    C
3    D
4    E

# Memilih kolom bertipe data datetime

In [11]:
df.select_dtypes(include='datetime')

                index
0 2024-10-01 00:00:00
1 2024-10-01 01:00:00
2 2024-10-01 02:00:00
3 2024-10-01 03:00:00
4 2024-10-01 04:00:00

# Memilih kolom dengan kombinasi tipe data

In [12]:
df.select_dtypes(include=['number', 'object'])

   bil_pecahan  bil_bulat teks
0         19.0         17    A
1          4.0          6    B
2         15.0          8    C
3          4.0          2    D
4         14.0         14    E